ksekimoto/netmf-interpreter/DeviceCode/Targets/Native/RX65N/DeviceCode/RX65N_USB/RX65N_usb_functions.cpp
////////////////////////////////////////////////////////////////////////////
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//    http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//  Copyright (c) Microsoft Corporation.  All rights reserved.
//  Copyright (C) 2010 Renesas Electronics Corporation. All rights reserved.
//  Portions Copyright (c) Kentaro Sekimoto All rights reserved.
//
////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////
// Based on RENESAS usb_hal.cpp
////////////////////////////////////////////////////////////////////////////

#include <tinyhal.h>
#include <Include\USB_decl.h>
#include <pal\com\usb\USB.h>
#include "..\RX65N.h"
#include "RX65N_usb_functions.h"

//*********************************************************************************
// NETMF default endpoint
// EP0  Control
// EP1  Bulk In
// EP2  Bulk Out
//*********************************************************************************
// GR-ROSE Board information
//*********************************************************************************
// VBUS         P16
// USB_DM       47pin
// USB_DP       48pin
// USB0_DPRPD   32pin (P25) - DP
// USB0_DPUPE-B 43pin (P14)
// USB0_DRPD    (P22) - DM
//*********************************************************************************
//*********************************************************************************
// Defines
//*********************************************************************************

//#define DEBUG_USB
//#define USB_DUMP_SEND
//#define USB_DUMP_RECEIVE
//#define USB_DUMP_PID
//#define USB_USE_TXZERO_INT

#if defined(DEBUG_USB)
#define USB_DEBUG1(x0)          debug_printf(x0)
#define USB_DEBUG2(x0,x1)       debug_printf(x0,x1)
#define USB_DEBUG3(x0,x1,x2)    debug_printf(x0,x1,x2)
#define USB_DEBUG4(x0,x1,x2,x3) debug_printf(x0,x1,x2,x3)
#else
#define USB_DEBUG1(x0)
#define USB_DEBUG2(x0,x1)
#define USB_DEBUG3(x0,x1,x2)
#define USB_DEBUG4(x0,x1,x2,x3)
#endif

static USB_CONTROLLER_STATE g_USB_ControllerState = {0};
Hal_Queue_KnownSize<USB_PACKET64,USB_QUEUE_PACKET_COUNT> QueueBuffers[USB_MAX_EP - 1];
static UINT8 USB_EP0Buffer[MAX_EP0_SIZE];
static UINT16 USB_EPStatus[USB_MAX_EP];
static const USB_ENDPOINT_DESCRIPTOR *USB_EPDesc[USB_MAX_EP];
static BOOL USB_PinsProtected = FALSE;
static UINT16 USB_EP_Type = 0;
static INT8 USB_Pipe[USB_MAX_EP];
static INT8 USB_Zero = 0;
static INT8 USB_FifoType[USB_MAX_PIPE];
static volatile PIPECTR *pPIPECTR[USB_MAX_PIPE] = {
    (volatile PIPECTR *)&USB0.DCPCTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE1CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE2CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE3CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE4CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE5CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE6CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE7CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE8CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE9CTR.WORD
};

static volatile UINT16 *pFIFOSEL[USB_MAX_FIFO] =
{
    (volatile UINT16 *)&USB0.CFIFOSEL.WORD,
    (volatile UINT16 *)&USB0.D0FIFOSEL.WORD,
    (volatile UINT16 *)&USB0.D1FIFOSEL.WORD
};

static volatile UINT16 *pFIFOCTR[USB_MAX_FIFO] =
{
    (volatile UINT16 *)&USB0.CFIFOCTR.WORD,
    (volatile UINT16 *)&USB0.D0FIFOCTR.WORD,
    (volatile UINT16 *)&USB0.D1FIFOCTR.WORD
};

#if 1
static volatile UINT8 *pFIFO[USB_MAX_FIFO] =
{
    (volatile UINT8 *)&USB0.CFIFO,
    (volatile UINT8 *)&USB0.D0FIFO,
    (volatile UINT8 *)&USB0.D1FIFO
};
#else
static volatile UINT16 *pFIFO[USB_MAX_FIFO] =
{
    (volatile UINT16 *)&USB0.CFIFO.WORD,
    (volatile UINT16 *)&USB0.D0FIFO.WORD,
    (volatile UINT16 *)&USB0.D1FIFO.WORD
};
#endif
static UINT32 pipe_bulk = PIPE_BULK_ST;
static UINT32 pipe_interrupt = PIPE_INT_ST;

static void usb_memory_dump(unsigned int addr, int len)
{
    int i;
    char *p = (char *)addr;
    for (i = 0; i < len; i++) {
        if ((i & 0xf) == 0) {
            debug_printf((char *)"%08x ", (unsigned int)p);
        }
        debug_printf((char *)"%02x ", (unsigned char)(*p & 0xff));
        if ((i & 0xf) == 0xf) {
            debug_printf((char *)"\r\n");
        }
        p++;
    }
    debug_printf((char *)"\r\n");
}

static void wait_cnt(volatile UINT32 count)
{
    while (count-- > 0);
}

void usb_int_brdy_enable(UINT16 pipe)
{
    UINT16 tmp;
    tmp = USB0.INTENB0.WORD;
    USB0.INTENB0.WORD = (UINT16)(tmp & (UINT16)~(MASK_BEMPE|MASK_NRDYE|MASK_BRDYE));
    USB0.BRDYENB.WORD |= (1 << pipe);
    USB0.INTENB0.WORD = tmp;
}

void usb_int_brdy_disable(UINT16 pipe)
{
    UINT16  tmp;
    tmp = USB0.INTENB0.WORD;
    USB0.INTENB0.WORD = (UINT16)(tmp & (UINT16)~(MASK_BEMPE|MASK_NRDYE|MASK_BRDYE));
    USB0.BRDYENB.WORD &= ~(1 << pipe);
    USB0.INTENB0.WORD = tmp;
}

void usb_int_nrdy_enable(UINT16 pipe)
{
    UINT16  tmp;
    tmp = USB0.INTENB0.WORD;
    USB0.INTENB0.WORD = (UINT16)(tmp & (UINT16)~(MASK_BEMPE|MASK_NRDYE|MASK_BRDYE));
    USB0.NRDYENB.WORD |= (1 << pipe);
    USB0.INTENB0.WORD = tmp;
}

void usb_int_nrdy_disable(UINT16 pipe)
{
    UINT16 tmp;
    tmp = USB0.INTENB0.WORD;
    USB0.INTENB0.WORD = (UINT16)(tmp & (UINT16)~(MASK_BEMPE|MASK_NRDYE|MASK_BRDYE));
    USB0.NRDYENB.WORD &= ~(1 << pipe);
    USB0.INTENB0.WORD = tmp;
}

void usb_int_bemp_enable(UINT16 pipe)
{
    UINT16 tmp;
    tmp = USB0.INTENB0.WORD;
    USB0.INTENB0.WORD = (UINT16)(tmp & (UINT16)~(MASK_BEMPE|MASK_NRDYE|MASK_BRDYE));
    USB0.BEMPENB.WORD |= (1 << pipe);
    USB0.INTENB0.WORD = tmp;
}

void usb_int_bemp_disable(UINT16 pipe)
{
    UINT16 tmp;
    tmp = USB0.INTENB0.WORD;
    USB0.INTENB0.WORD = (UINT16)(tmp & (UINT16)~(MASK_BEMPE|MASK_NRDYE|MASK_BRDYE));
    USB0.BEMPENB.WORD &= ~(1 << pipe);
    USB0.INTENB0.WORD = tmp;
}

static void USB_Pipe_Initialize(void)
{
    UINT32 i;
    for (i = 0; i < USB_MAX_PIPE; i++) {
        USB_FifoType[i] = -1;
    }
    USB_FifoType[0] = FIFO_CFIFO;
    USB_FifoType[1] = FIFO_D1FIFO;
    USB_FifoType[2] = FIFO_CFIFO;
    USB_FifoType[3] = FIFO_CFIFO;
    USB_FifoType[4] = FIFO_CFIFO;
    USB_FifoType[5] = FIFO_CFIFO;
    USB0.CFIFOSEL.WORD = 0;
    USB0.D0FIFOSEL.WORD = 0;
    USB0.D1FIFOSEL.WORD = 0;
}

UINT16 GetPipePid(UINT32 pipe)
{
    volatile PIPECTR *pipectr = pPIPECTR[pipe];
    return (pipectr->BIT.PID);
}

