ksekimoto/netmf-interpreter/DeviceCode/Targets/Native/RX65N/DeviceCode/RX65N_USB/RX65N_usb_functions.cpp
UINT16 Pipe_Inbuf(UINT16 pipe)
{
    UINT16 inbuf;
    volatile PIPECTR *pipectr = pPIPECTR[pipe];
    inbuf = pipectr->BIT.INBUFM;
    return inbuf;
}

#ifdef USB_DUMP_PID
void dump_pid(UINT32 pipe)
{
    volatile PIPECTR *pipectr = pPIPECTR[pipe];
    UINT16 pid = pipectr->BIT.PID;
    USB_DEBUG3("Pi%d:%d\r\n", pipe, pid);
}
#endif

void SetPipePidNAK(UINT32 pipe)
{
    volatile PIPECTR *pipectr = pPIPECTR[pipe];
    UINT16 cpid = (pipectr->BIT.PID);
    if (cpid == PID_STALL_2) {
        pipectr->BIT.PID = PID_STALL_1;
    }
    pipectr->BIT.PID = PID_NAK;
    if (cpid == PID_BUF) {
        while (pipectr->BIT.PBUSY == 1);
    }
}

void SetPipePidBUF(UINT32 pipe)
{
    volatile PIPECTR *pipectr = pPIPECTR[pipe];
    pipectr->BIT.PID = PID_BUF;
}

void ClearPipeFIFO(UINT32 pipe)
{
    if (USB0.CFIFOSEL.BIT.CURPIPE == pipe)
        USB0.CFIFOSEL.BIT.CURPIPE = 0;
    if (USB0.D0FIFOSEL.BIT.CURPIPE == pipe)
        USB0.D0FIFOSEL.BIT.CURPIPE = 0;
    if (USB0.D1FIFOSEL.BIT.CURPIPE == pipe)
        USB0.D1FIFOSEL.BIT.CURPIPE = 0;
}

#define FIFO_LOOP       4
#define FIFO_TIMEOUT    2000

void PipeSetFIFO(UINT16 pipe, UINT16 dir, UINT16 mbw)
{
    volatile UINT16 tmp;
    UINT8 type;
    if (pipe >= 0) {
        ClearPipeFIFO(pipe);
        type = USB_FifoType[pipe];
        volatile UINT16 *pfifosel = pFIFOSEL[type];
        volatile UINT16 *pfifoctr = pFIFOCTR[type];
        for (UINT32 i = 0; i < FIFO_LOOP; i++) {
            tmp = *pfifosel;
            if (type == FIFO_CFIFO) {
                tmp &= 0xFBD0;
                tmp |= ((mbw << 10) | (dir << 5) | pipe);
            } else {
                tmp &= 0xFBF0;
                tmp |= ((mbw << 10) | pipe);
            }
            *pfifosel = tmp;
            wait_cnt(FIFO_TIMEOUT);
            volatile UINT16 j = FIFO_TIMEOUT;
            while (j-- > 0) {
                if (*pfifosel == tmp)
                    break;
            }
            j = FIFO_TIMEOUT;
            while (j-- > 0) {  // FRDY
                if ((*pfifoctr & 0x2000) != 0)
                    return;
            }
        }
        USB_DEBUG3("PipeNG%d:%d\r\n", pipe, dir);
    }
}

void RX_USB_Interrupt_Enable(void)
{
	ICU.IER[0x0B].BIT.IEN2 = 1; /* Enable USBR0 interrupt */
    ICU.IPR[90].BYTE    = 0x0E; /* USBR0 */
    ICU.SLIBXR137.BYTE = 62;
    /*Enable USB interrupts at high level*/
    ICU.IER[IER_PERIB_INTB137].BIT.IEN1 = 1;
    /*Set interrupt priority*/
    ICU.IPR[IPR_PERIB_INTB137].BIT.IPR = 0x0E;
    /*Clear USB0 interrupt flag*/
    ICU.IR[IR_PERIB_INTB137].BIT.IR = 0;
}

void RX_USB_Pullup_Connect(void)
{
    USB0.SYSCFG.BIT.DPRPU = 1;
}

void RX_USB_Pullup_Disconnect(void)
{
    USB0.SYSCFG.BIT.DPRPU = 0;
}

void RX_USB_Interrupt_Initialize(void)
{
    //USB0.SOFCFG.WORD = 0x20;
    USB0.INTENB0.WORD = 0x9F00;
    //USB0.INTENB0.BIT.VBSE = 1;          // b15
    //USB0.INTENB0.BIT.DVSE = 1;          // b12
    //USB0.INTENB0.BIT.CTRE = 1;          // b11
    //USB0.INTENB0.BIT.BEMPE = 1;         // b10
    //USB0.INTENB0.BIT.NRDYE = 1;         // b9
    //USB0.INTENB0.BIT.BRDYE = 1;         // b8

    USB0.BEMPENB.BIT.PIPE0BEMPE = 1;    // pipe 0 bemp interrupt enable
    USB0.BRDYENB.BIT.PIPE0BRDYE = 0;    // pipe 0 brdy inerrrupt disable
}

void RX_USB_Interrupt_Uninitialize(void)
{
    //USB0.SOFCFG.WORD = 0x20;
    USB0.INTENB0.WORD = 0x0000;
    //USB0.INTENB0.BIT.VBSE = 0;          // b15
    //USB0.INTENB0.BIT.DVSE = 0;          // b12
    //USB0.INTENB0.BIT.CTRE = 0;          // b11
    //USB0.INTENB0.BIT.BEMPE = 0;         // b10
    //USB0.INTENB0.BIT.NRDYE = 0;         // b9
    //USB0.INTENB0.BIT.BRDYE = 0;         // b8
    ICU.IER[0x0B].BIT.IEN2 = 0; /* Disable USBR0 interrupt */
    ICU.IER[0x11].BIT.IEN1 = 0; /* Disable USBI0 interrupt */
}


void USB0_HW_Initialize(void)
{
    SYSTEM.PRCR.WORD = 0xA502;          /* protect off */
    //MSTP(USB0) = 0;
    SYSTEM.MSTPCRB.BIT.MSTPB19 = 0;
    SYSTEM.PRCR.WORD = 0xA500;          /* protect on */

    USB.DPUSR0R.BIT.FIXPHY0 = 0u;   /* USB0 Transceiver Output fixed */

    MPC.PWPR.BIT.B0WI   = 0u;   // Enable PFSWE bit
    MPC.PWPR.BIT.PFSWE  = 1u;   // Enable PFS register
    /* Set USB0_VBUS pin */
    MPC.P16PFS.BYTE = 0x11U;
    PORT1.PMR.BIT.B6 = 1U;
    MPC.PWPR.BIT.PFSWE  = 0u;   // Disable PFS register
    MPC.PWPR.BIT.B0WI   = 1u;   // Disable PFSWE bit
}

void RX_USB_HW_Initialize(void)
{
    USB0_HW_Initialize();
    USB0.SYSCFG.BIT.SCKE = 1;
    USB0.SYSCFG.BIT.USBE = 1;
    USB0.SYSCFG.BIT.DCFM = 0;
    //USB0.SYSCFG.BIT.DPRPU = 1;
    USB_Pipe_Initialize();
    RX_USB_Interrupt_Initialize();
    RX_USB_Interrupt_Enable();
}

void RX_USB_EP_Initialize(UINT32 pipe, UINT32 ep, UINT32 dir, UINT32 attr, UINT32 size)
{
    ClearPipeFIFO(pipe);
    volatile PIPECTR *pipectr = pPIPECTR[pipe];
    USB0.PIPESEL.BIT.PIPESEL = pipe;
    SetPipePidNAK(pipe);
    USB0.PIPECFG.WORD = 0;
    USB0.PIPECFG.BIT.EPNUM = ep;        // Endpoint
    USB0.PIPECFG.BIT.DIR = dir;         // Direction
    USB0.PIPECFG.BIT.DBLB = 1;          // Double Buffer
    USB0.PIPECFG.BIT.BFRE = 0;          // Interrupt
    //USB0.PIPECFG.BIT.SHTNAK = 1;
    if (attr == USB_ENDPOINT_ATTRIBUTE_BULK) {
        USB0.PIPECFG.BIT.TYPE = 1;      // BULK
        if (dir == 0) { // OUT
            //pipectr->BIT.ATREPM = 1;
            pipectr->BIT.SQCLR = 1;
            pipectr->BIT.ACLRM = 1;     // Clear Buffer
            pipectr->BIT.ACLRM = 0;     // Clear Buffer
            pipectr->BIT.PID = PID_BUF;
            //PipeSetFIFO((UINT16)pipe, dir, MBW_BYTE);
            usb_int_bemp_disable(pipe);
            usb_int_brdy_disable(pipe);
            //usb_int_brdy_enable(pipe);
        } else {        // IN
            //pipectr->BIT.ATREPM = 1;
            pipectr->BIT.SQCLR = 1;
            pipectr->BIT.ACLRM = 1;     // Clear Buffer
            pipectr->BIT.ACLRM = 0;     // Clear Buffer
            //PipeSetFIFO((UINT16) pipe, dir, MBW_BYTE);
            usb_int_bemp_disable(pipe);
            usb_int_brdy_disable(pipe);
        }
        USB0.PIPEMAXP.BIT.MXPS = size;  // Packet Size
    } else if (attr == USB_ENDPOINT_ATTRIBUTE_INTERRUPT) {
        USB0.PIPECFG.BIT.TYPE = 2;      // Transfer Type
        USB0.PIPEMAXP.BIT.MXPS = size;  // Packet Size
        //usb_int_bemp_disable(pipe);
        //usb_int_brdy_disable(pipe);
    } else if (attr == USB_ENDPOINT_ATTRIBUTE_ISOCHRONOUS) {
        USB0.PIPECFG.BIT.TYPE = 3;      // Transfer Type
        USB0.PIPEMAXP.BIT.MXPS = size;  // Packet Size
        //usb_int_bemp_disable(pipe);
        //usb_int_brdy_disable(pipe);
    }
    USB0.PIPESEL.BIT.PIPESEL = 0;       // Unselect Pipe
}

void USB_Control_Status(void)
{
    USB0.DCPCTR.BIT.PID = PID_BUF;
    USB0.DCPCTR.BIT.CCPL = 1;
}

void USB_Stall_Clear(INT32 pipe)
{
    volatile PIPECTR *pipectr = pPIPECTR[pipe];
    pipectr->BIT.PID = PID_NAK;
    while (pipectr->BIT.PBUSY == 1){;}
    pipectr->BIT.SQCLR = 1;
    pipectr->BIT.ACLRM = 1;
    pipectr->BIT.ACLRM = 0;
    USB0.PIPESEL.BIT.PIPESEL = pipe;
    if (USB0.PIPECFG.BIT.DIR == 0) {
        // receive direction
        pipectr->BIT.PID = PID_BUF;
    }
}

